Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/PIC32CM-LS00/include/pio/pic32cm1216ls00064.h
#define PIN_PB03J_TCC3_WO3                         _UL_(35)    
#define MUX_PB03J_TCC3_WO3                         _UL_(9)     
#define PINMUX_PB03J_TCC3_WO3                      ((PIN_PB03J_TCC3_WO3 << 16) | MUX_PB03J_TCC3_WO3)
#define PORT_PB03J_TCC3_WO3                        (_UL_(1) << 3)

#define PIN_PA06J_TCC3_WO4                         _UL_(6)     
#define MUX_PA06J_TCC3_WO4                         _UL_(9)     
#define PINMUX_PA06J_TCC3_WO4                      ((PIN_PA06J_TCC3_WO4 << 16) | MUX_PA06J_TCC3_WO4)
#define PORT_PA06J_TCC3_WO4                        (_UL_(1) << 6)

#define PIN_PA30J_TCC3_WO4                         _UL_(30)    
#define MUX_PA30J_TCC3_WO4                         _UL_(9)     
#define PINMUX_PA30J_TCC3_WO4                      ((PIN_PA30J_TCC3_WO4 << 16) | MUX_PA30J_TCC3_WO4)
#define PORT_PA30J_TCC3_WO4                        (_UL_(1) << 30)

#define PIN_PA07J_TCC3_WO5                         _UL_(7)     
#define MUX_PA07J_TCC3_WO5                         _UL_(9)     
#define PINMUX_PA07J_TCC3_WO5                      ((PIN_PA07J_TCC3_WO5 << 16) | MUX_PA07J_TCC3_WO5)
#define PORT_PA07J_TCC3_WO5                        (_UL_(1) << 7)

#define PIN_PA31J_TCC3_WO5                         _UL_(31)    
#define MUX_PA31J_TCC3_WO5                         _UL_(9)     
#define PINMUX_PA31J_TCC3_WO5                      ((PIN_PA31J_TCC3_WO5 << 16) | MUX_PA31J_TCC3_WO5)
#define PORT_PA31J_TCC3_WO5                        (_UL_(1) << 31)

#define PIN_PB08J_TCC3_WO6                         _UL_(40)    
#define MUX_PB08J_TCC3_WO6                         _UL_(9)     
#define PINMUX_PB08J_TCC3_WO6                      ((PIN_PB08J_TCC3_WO6 << 16) | MUX_PB08J_TCC3_WO6)
#define PORT_PB08J_TCC3_WO6                        (_UL_(1) << 8)

#define PIN_PB09J_TCC3_WO7                         _UL_(41)    
#define MUX_PB09J_TCC3_WO7                         _UL_(9)     
#define PINMUX_PB09J_TCC3_WO7                      ((PIN_PB09J_TCC3_WO7 << 16) | MUX_PB09J_TCC3_WO7)
#define PORT_PB09J_TCC3_WO7                        (_UL_(1) << 9)

/* ========== PORT definition for USB peripheral ========== */
#define PIN_PA24G_USB_DM                           _UL_(24)    
#define MUX_PA24G_USB_DM                           _UL_(6)     
#define PINMUX_PA24G_USB_DM                        ((PIN_PA24G_USB_DM << 16) | MUX_PA24G_USB_DM)
#define PORT_PA24G_USB_DM                          (_UL_(1) << 24)

#define PIN_PA25G_USB_DP                           _UL_(25)    
#define MUX_PA25G_USB_DP                           _UL_(6)     
#define PINMUX_PA25G_USB_DP                        ((PIN_PA25G_USB_DP << 16) | MUX_PA25G_USB_DP)
#define PORT_PA25G_USB_DP                          (_UL_(1) << 25)

#define PIN_PB22G_USB_SOF_1KHZ                     _UL_(54)    
#define MUX_PB22G_USB_SOF_1KHZ                     _UL_(6)     
#define PINMUX_PB22G_USB_SOF_1KHZ                  ((PIN_PB22G_USB_SOF_1KHZ << 16) | MUX_PB22G_USB_SOF_1KHZ)
#define PORT_PB22G_USB_SOF_1KHZ                    (_UL_(1) << 22)



#endif /* _PIC32CM1216LS00064_GPIO_H_ */

